InformationRegisters/SM_СтатусСогласованияДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>SM_СтатусСогласованияДокумента</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументИсполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Comment>Сотрудники компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Comment>Должность сотрудника компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение компании, к которому относится сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Компания, к которой относится сотрудник</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Comment>Дата приема на работу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Comment>Дата увольнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагУволен</Name>
					<Comment>Флаг уволен</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Comment>Дата рождения сотрудника</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДеньРождения</Name>
					<Comment>Месяц и число дня рождения сотрудника для сортировки списка по дням рождения. Формируется автоматически от даты рождения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>Содержит ссылку на график работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Признак сотрудника как исполнителя работ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Comment>Основной цех</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Псевдоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольУРВ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийТелефон</Name>
					<Comment>Номер внутреннего рабочего телефона сотрудника</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийТелефонСотовый</Name>
					<Comment>Корпоративный рабочий сотовый телефон</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДТ_ОкладДляМотивации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДТ_Окладник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>telegramId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезОтчества</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалённыйРежимРаботы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПодразделенийРаботы</Name>
					<Comment>Таблица подразделений, в которых работает сотрудник</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаПодразделенийГК</Name>
					<Comment>Таблица подразделений Группы Компаний, в которых работает сотрудник</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодразделениеГК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/SM_ПроцедурыФункцииСогласованияСервер/Ext/Module.bsl
//Сервер
Функция СформироватьJSONДокументаДляСогласованияВДокументооборот(Документ,ПовторноеСогласование = Ложь,Сотрудник,Руководитель,ИтоговыйСогласователь)Экспорт
	 JSONСтруктураДокумента = ПолучитьСвойстваОбъектаПоТипуДокумента(Документ);
	 СтруктураДокумента = ПрочитатьJSON_В_Структуру(JSONСтруктураДокумента);
	 Если СтруктураДокумента <> Неопределено И СтруктураДокумента <> "" Тогда 
		 СтруктураJSON = СформироватьТекстовоеПредставлениеДокументаИJSON(Документ,СтруктураДокумента,ПовторноеСогласование,Сотрудник,Руководитель,ИтоговыйСогласователь);
	 Иначе 
		 //ПоказатьОповещение("Отсутствует шаблон для разбора документа.");
		 СтруктураJSON = Неопределено;
	 КонецЕсли;
	 
	 Возврат СтруктураJSON; 	 
КонецФункции 
//Сервер
Функция ПолучитьСвойстваОбъектаПоТипуДокумента(Документ)Экспорт
	JSON = СформироватьJSONТипДокумента(Документ.Метаданные().Имя);
	Возврат ОтправитьЗапросВДокументооборот("GetStructureDocument",JSON,Истина) 
КонецФункции
//Сервер
Функция СформироватьТекстовоеПредставлениеДокументаИJSON(Документ,СтруктураДокумента,ПовторноеСогласование = Ложь,Сотрудник,Руководитель,ИтоговыйСогласователь)Экспорт
	ТекстДокумента = "";
	ТекстТабличнойЧасти = "";
	МетаданныеДокумента = Документ.Метаданные();
	СтруктураJSON = Новый Структура;  
	
	Если ПовторноеСогласование Тогда 
		СтруктураJSON.Вставить("ПовторноеСогласование");
	КонецЕсли;
	
	Для Каждого Строка Из СтруктураДокумента Цикл
		НаименованиеРеквизит = Строка.Ключ;
		Если НаименованиеРеквизит = "УникальныйИдентификатор" Тогда
			СтруктураJSON.Вставить("УникальныйИдентификатор",Строка(Документ.УникальныйИдентификатор()));
			Продолжить;
		КонецЕсли;
		Попытка
			ПредставлениеРеквизита	= МетаданныеДокумента.Реквизиты[НаименованиеРеквизит].Представление();
			ЗначениеРеквизита		= Документ[Строка.Ключ]; 
			Если НаименованиеРеквизит = "СуммаДокумента" Тогда
				СтруктураJSON.Вставить(НаименованиеРеквизит,ЗначениеРеквизита);
			КонецЕсли;
			ТекстДокумента = ТекстДокумента + ПредставлениеРеквизита + ": " + ЗначениеРеквизита + Символы.ПС;
		Исключение
			ЗначениеКлюча = Строка.Значение;
			Если ТипЗнч(ЗначениеКлюча) = Тип("Структура") Тогда
				МетаданныеТабличнаяЧасть	= МетаданныеДокумента.ТабличныеЧасти[НаименованиеРеквизит];
				РеквизитыТабличнойЧасти     = МетаданныеТабличнаяЧасть.Реквизиты;
				ТабличнаяЧасть				= Документ[НаименованиеРеквизит];
				ТекстТабличнойЧасти			= ТекстТабличнойЧасти + "Табличная часть " + МетаданныеТабличнаяЧасть.Представление() + ":";
				Для Каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
					ТекущаяСтрокаТабличнойЧасти = Строка(СтрокаТабличнойЧасти.НомерСтроки) + ")";
					Для Каждого СвойствоТабличнойЧасти Из ЗначениеКлюча Цикл
						ТекущееСвойствоТабличнойЧасти = СвойствоТабличнойЧасти.Ключ;
						ТекущаяСтрокаТабличнойЧасти = ТекущаяСтрокаТабличнойЧасти + Строка(СтрокаТабличнойЧасти[ТекущееСвойствоТабличнойЧасти]) + " | ";
					КонецЦикла;
					ТекстТабличнойЧасти = ТекстТабличнойЧасти + Символы.ПС + ТекущаяСтрокаТабличнойЧасти ;
				КонецЦикла;
			КонецЕсли;		
		КонецПопытки;	
	КонецЦикла;  
	ИтогСтроковеПредставлениеДокумента = ТекстДокумента + ТекстТабличнойЧасти;
	СтруктураJSON.Вставить("Руководитель"					,Руководитель);
	СтруктураJSON.Вставить("ИтоговыйСогласователь"			,ИтоговыйСогласователь);
	СтруктураJSON.Вставить("Сотрудник"						,Сотрудник);
	СтруктураJSON.Вставить("ТекстовоеПредставлениеДокумента",ИтогСтроковеПредставлениеДокумента);
	СтруктураJSON.Вставить("Ссылка"							,Строка(Документ));
	СтруктураJSON.Вставить("ТипДокумента"					,МетаданныеДокумента.Имя);
	Возврат СтруктураJSON;
КонецФункции
//Сервер 
Функция СформироватьJSONУникальныйИдентификатор(УникальныйИдентификатор)Экспорт
	 ЗаписьJSON = Новый ЗаписьJSON;
	 ЗаписьJSON.УстановитьСтроку();
	 ЗаписатьJSON(ЗаписьJSON,Новый Структура ("УникальныйИдентификатор",Строка(УникальныйИдентификатор)));
	 Возврат ЗаписьJSON.Закрыть();   	 
КонецФункции
//Сервер 
Функция СформироватьJSONТипДокумента(ТипДокумента) Экспорт
	 ЗаписьJSON = Новый ЗаписьJSON;
	 ЗаписьJSON.УстановитьСтроку();
	 ЗаписатьJSON(ЗаписьJSON,Новый Структура ("ТипДокумента",Строка(ТипДокумента)));
	 Возврат ЗаписьJSON.Закрыть();   	 
КонецФункции
//Сервер
Функция ПрочитатьJSON_В_Структуру(JSON)Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSON);
	Возврат ПрочитатьJSON(ЧтениеJSON);	
КонецФункции
//Сервер
Функция ОтправитьЗапросВДокументооборот(Метод,JSON,ПолучитьТело = Ложь) Экспорт
	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.АдресРесурса = "/doc3/hs/APIOfDocument/" + Метод;
	HTTPЗапрос.УстановитьТелоИзСтроки(JSON,"UTF-8");
	HTTPСоединение = Новый HTTPСоединение("1c01",,"Soglasovator","1234");
	
	HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("GET", HTTPЗапрос);	
	Если ПолучитьТело Тогда
		Возврат HTTPОтвет.ПолучитьТелоКакСтроку("UTF-8");
	Иначе
		Возврат Новый Структура("КодСостояния",HTTPОтвет.КодСостояния);
	КонецЕсли;		
КонецФункции    
//Сервер
Функция ПроизвестиЧтениеТаблицыИзXMLСервер(СтрокаXML) Экспорт
    ЧтениеXML = Новый ЧтениеXML;
    ЧтениеXML.УстановитьСтроку(СтрокаXML);
    ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://v8.1c.ru/8.1/data/core","ValueTable");
    ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML,ТипОбъектаXDTO); 
    ОбъектXDTO.Проверить();
    
    ЧтениеXML.Закрыть();
    Возврат СериализаторXDTO.ПрочитатьXDTO(ОбъектXDTO);   
КонецФункции  
//Сервер
Процедура ЗаполнитьРезультатыСогласования(УникальныйИдентификатор,ДокументСсылка)Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.SM_СтатусСогласованияДокумента КАК SM_СтатусСогласованияДокумента
		|ГДЕ
		|	SM_СтатусСогласованияДокумента.Документ = &Документ
		|	И (ВЫРАЗИТЬ(SM_СтатусСогласованияДокумента.Статус КАК СТРОКА(100))) = ""Открыт""";
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда		
		JSON = СформироватьJSONУникальныйИдентификатор(УникальныйИдентификатор);
		СтрокаXML = ОтправитьЗапросВДокументооборот("GetResults",JSON,Истина); 
		Таблица = ПроизвестиЧтениеТаблицыИзXMLСервер(СтрокаXML);
		Исполнитель = "";
		Для Каждого Строка Из Таблица Цикл
			Сотрудник = ПоискСотрудника(Строка.Исполнитель);
			РегистрыСведений.SM_СтатусСогласованияДокумента.ДобавитьЗапись(ДокументСсылка,Строка.Статус,Строка.Причина,Строка.Дата,Строка.НомерИтерации,Строка.ДокументИсполнения,,Сотрудник);
			Если Строка.Статус = "Согласовано" Тогда
				Исполнитель = Сотрудник;
			КонецЕсли;		
		КонецЦикла;  
		РегистрыСведений.SM_СтатусСогласованияДокумента.ДобавитьЗапись(ДокументСсылка,"Закрыт","",ТекущаяДата(),,,,Исполнитель);
	КонецЕсли;
	//Открыт,Закрыт	
КонецПроцедуры  
//Сервер
Функция ПоискРуководителяСогласоватора(Сотрудник)Экспорт
	ДеревоПодразделениеСотрудник = ХранилищеОбщихНастроек.Загрузить("ДеревоСотрудникиОтделаМаркетинга","TRUE",,"Дерево");
	Если ДеревоПодразделениеСотрудник = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	НайденнаяСтрокаСотрудника = ДеревоПодразделениеСотрудник.Строки.Найти(Сотрудник,"Подразделение_Сотрудник",Истина);
	Если НайденнаяСтрокаСотрудника <> Неопределено Тогда
		Возврат РекурсивныйПоискРуководителя(НайденнаяСтрокаСотрудника);
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции 
//Сервер
Функция РекурсивныйПоискРуководителя(СтрокаСотрудника)
	ЭтоРуководитель			= СтрокаСотрудника.РуководительОтметака;
	ЭтоСогласоватор			= СтрокаСотрудника.УчавствуетВСогласованииОтметка;
	ЭтоНеПоследнийЭлемент	= Не СтрокаСотрудника.Родитель = Неопределено;
	Руководитель			= СтрокаСотрудника.Подразделение_Сотрудник;
	ИтоговыйСогласователь	= СтрокаСотрудника.ИтоговыйСогласователь;
	СледующийСотрудник		= СтрокаСотрудника.Родитель;
	
	Если ЭтоРуководитель И ЭтоСогласоватор Тогда
		Структура = Новый Структура("Руководитель,ИтоговыйСогласователь",Руководитель,ИтоговыйСогласователь);
		Возврат Структура;
	ИначеЕсли (ЭтоРуководитель И Не ЭтоСогласоватор) ИЛИ (Не ЭтоРуководитель) Тогда 
		Если ЭтоНеПоследнийЭлемент Тогда
			Возврат РекурсивныйПоискРуководителя(СледующийСотрудник);
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
	КонецЕсли;
КонецФункции   
//Сервер
Функция ЗаписатьСтруктуруВJSON(СтруктураJSON)Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON,СтруктураJSON);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция ПрерватьСогласование(СсылкаДокумент)Экспорт
	JSON = СформироватьJSONУникальныйИдентификатор(СсылкаДокумент.УникальныйИдентификатор());
	Ответ = ОтправитьЗапросВДокументооборот("StopАpproval",JSON,Истина);
	РегистрыСведений.SM_СтатусСогласованияДокумента.ДобавитьЗапись(СсылкаДокумент,"Прерван","Прервано пользователем",ТекущаяДата());
КонецФункции

Функция ПоискСотрудника(СтрокаФИО)Экспорт
	Если Не ЗначениеЗаполнено(СтрокаФИО) Тогда
		Возврат СтрокаФИО;
	КонецЕсли;
	
	Пользователь = Справочники.Пользователи.НайтиПоКоду(СтрокаФИО); 
	Если ЗначениеЗаполнено(Пользователь) Тогда
		Сотрудник = Пользователь.Сотрудник;
		Если ЗначениеЗаполнено(Сотрудник) Тогда 
			Возврат Сотрудник;
		КонецЕсли;
	КонецЕсли;      
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.ДатаПриема КАК ДатаПриема
	|ПОМЕСТИТЬ ПоискСотрудника
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления
	|	И Сотрудники.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ Сотрудники.ФлагУволен
	|	И Сотрудники.Наименование ПОДОБНО &Наименование + ""%""
	|	И (ВЫРАЗИТЬ(НРЕГ(СТРЗАМЕНИТЬ(Сотрудники.Наименование, "" "", """")) КАК СТРОКА(100))) = (ВЫРАЗИТЬ(НРЕГ(СТРЗАМЕНИТЬ(&Наименование, "" "", """")) КАК СТРОКА(100)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПоискСотрудника.Ссылка КАК Ссылка
	|ИЗ
	|	ПоискСотрудника КАК ПоискСотрудника";
	
	Запрос.УстановитьПараметр("Наименование", СтрокаФИО);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат РезультатЗапроса.Выгрузить()[0].Ссылка;
	Иначе
		Возврат СтрокаФИО;
	КонецЕсли;
КонецФункции
